package less_1;

/**
 * TheSusanin
 * 2/7/2021 Feb 2021
 */
public class Main {
    public static void main(String[] args) {
        short s = 4787;
        byte b = (byte) s;

        long l = 546442l;
        int i = (int) l;

        System.out.println(b);
        System.out.println(i);
    }
}



/*

Итак начнём:
1. Habr - много полезной информации, публикации от крупнейших IT компаний.

2. Unetway - портал, обмен опыта между джунами, миддлами и сеньорами.

3. Dou - свежие новости и статьи из айти мира.

4. IXBT - издание о компьютерной технике.

5. DevBy - коллективный блог, с it новостями и интервью.

6. Tproger - издание о разработке, авторские статьи и переводы и МЕМЫ

7. Pikabu - не совсем про айти, но кто хочет айти юмор , то welcome.

8. 4pda - любимый сайт о ноу хау, технике и хороший новостной портал.
*/
